STMicroelectronics/STM32CubeWB/Projects/P-NUCLEO-WB55.Nucleo/Applications/BLE/BLE_AT_Server/STM32_WPAN/App/app_ble.c
      /* USER CODE BEGIN BLUE_EVT */

      /* USER CODE END BLUE_EVT */
      }
      break; /* HCI_VENDOR_SPECIFIC_DEBUG_EVT_CODE */

      /* USER CODE BEGIN EVENT_PCKT */

      /* USER CODE END EVENT_PCKT */

      default:
      /* USER CODE BEGIN ECODE_DEFAULT*/

      /* USER CODE END ECODE_DEFAULT*/
      break;
  }
  return (SVCCTL_UserEvtFlowEnable);
}

APP_BLE_ConnStatus_t APP_BLE_Get_Server_Connection_Status(void)
{
    return BleApplicationContext.Device_Connection_Status;
}

#if (CFG_BUTTON_SUPPORTED == 1)
/* USER CODE BEGIN FD*/
void APP_BLE_Key_Button1_Action(void)
{
  P2PS_APP_SW1_Button_Action();
}

void APP_BLE_Key_Button2_Action(void)
{
#if (L2CAP_REQUEST_NEW_CONN_PARAM != 0 )
  UTIL_SEQ_SetTask( 1<<CFG_TASK_CONN_UPDATE_REG_ID, CFG_SCH_PRIO_0);
#endif

  return;
}

void APP_BLE_Key_Button3_Action(void)
{
}
#endif

/* USER CODE END FD*/
/*************************************************************
 *
 * LOCAL FUNCTIONS
 *
 *************************************************************/
static void Ble_Tl_Init( void )
{
  HCI_TL_HciInitConf_t Hci_Tl_Init_Conf;

  Hci_Tl_Init_Conf.p_cmdbuffer = (uint8_t*)&BleCmdBuffer;
  Hci_Tl_Init_Conf.StatusNotCallBack = BLE_StatusNot;
  hci_init(BLE_UserEvtRx, (void*) &Hci_Tl_Init_Conf);

  return;
}

static void Ble_Hci_Gap_Gatt_Init(void){

  uint8_t role;
  uint16_t gap_service_handle, gap_dev_name_char_handle, gap_appearance_char_handle;
  uint32_t srd_bd_addr[2];
  uint16_t appearance[1] = { BLE_CFG_GAP_APPEARANCE };
  tBleStatus ret = BLE_STATUS_INVALID_PARAMS;
  
  /**
   * Initialize HCI layer
   */
  /*HCI Reset to synchronise BLE Stack*/
  hci_reset();

  /**
   * Write the BD Address
   */
  if ((global_ble_addr_type == GAP_PUBLIC_ADDR) && (global_ble_cfg_addr_type == GAP_PUBLIC_ADDR))
  {
    ret = aci_hal_write_config_data(CONFIG_DATA_PUBADDR_OFFSET,
                              CONFIG_DATA_PUBADDR_LEN,
                              (uint8_t*) global_bdaddress);
    
    if (ret != BLE_STATUS_SUCCESS)
    {
      APP_DBG_MSG("  Fail   : aci_hal_write_config_data command - CONFIG_DATA_PUBADDR_OFFSET, result: 0x%x \n", ret);
    }
    else
    {
      APP_DBG_MSG("  Success: aci_hal_write_config_data command - CONFIG_DATA_PUBADDR_OFFSET\n");
      APP_DBG_MSG("  Public Bluetooth Address: %02x:%02x:%02x:%02x:%02x:%02x\n",global_bdaddress[5],global_bdaddress[4],global_bdaddress[3],global_bdaddress[2],global_bdaddress[1],global_bdaddress[0]);
    } 
    
    /* BLE MAC in ADV Packet */
    manuf_data[ sizeof(manuf_data)-6] = global_bdaddress[5];
    manuf_data[ sizeof(manuf_data)-5] = global_bdaddress[4];
    manuf_data[ sizeof(manuf_data)-4] = global_bdaddress[3];
    manuf_data[ sizeof(manuf_data)-3] = global_bdaddress[2];
    manuf_data[ sizeof(manuf_data)-2] = global_bdaddress[1];
    manuf_data[ sizeof(manuf_data)-1] = global_bdaddress[0];
    
    memcpy(&global_bdaddress[0], BleGetBdAddress(), sizeof(global_bdaddress));
  }
  else if (global_ble_addr_type == GAP_STATIC_RANDOM_ADDR)
  {
   /**
   * Static random Address
   * The two upper bits shall be set to 1
   * The lowest 32bits is read from the UDN to differentiate between devices
   * The RNG may be used to provide a random number on each power on
   */
    /* set the two upper bits to fit with random address definition */
    global_rand_bdaddress[5] |= 0xC0;
  
    ret = aci_hal_write_config_data(CONFIG_DATA_RANDOM_ADDRESS_OFFSET,
                              CONFIG_DATA_RANDOM_ADDRESS_LEN,
                              (uint8_t*) global_rand_bdaddress);
 
    if (ret != BLE_STATUS_SUCCESS)
    {
      APP_DBG_MSG("  Fail   : aci_hal_write_config_data command - CONFIG_DATA_RANDOM_ADDRESS_OFFSET, result: 0x%x \n", ret);
    }
    else
    {
      APP_DBG_MSG("  Success: aci_hal_write_config_data command - CONFIG_DATA_RANDOM_ADDRESS_OFFSET\n");
      APP_DBG_MSG("  Random Bluetooth Address: %02x:%02x:%02x:%02x:%02x:%02x\n", (uint8_t)(global_rand_bdaddress[5]),
                                                                                 (uint8_t)(global_rand_bdaddress[4]),
                                                                                 (uint8_t)(global_rand_bdaddress[3]),
                                                                                 (uint8_t)(global_rand_bdaddress[2]),
                                                                                 (uint8_t)(global_rand_bdaddress[1]),
                                                                                 (uint8_t)(global_rand_bdaddress[0]));
    }
  
    /* BLE MAC in ADV Packet */
    manuf_data[ sizeof(manuf_data)-6] = global_rand_bdaddress[5];
    manuf_data[ sizeof(manuf_data)-5] = global_rand_bdaddress[4];
    manuf_data[ sizeof(manuf_data)-4] = global_rand_bdaddress[3];
    manuf_data[ sizeof(manuf_data)-3] = global_rand_bdaddress[2];
    manuf_data[ sizeof(manuf_data)-2] = global_rand_bdaddress[1];
    manuf_data[ sizeof(manuf_data)-1] = global_rand_bdaddress[0];
    
  }
  else if (global_ble_cfg_addr_type == GAP_STATIC_RANDOM_ADDR)
  {
#if defined(CFG_STATIC_RANDOM_ADDRESS)
    srd_bd_addr[0] = CFG_STATIC_RANDOM_ADDRESS & 0xFFFFFFFF;
    srd_bd_addr[1] = (uint32_t)((uint64_t)CFG_STATIC_RANDOM_ADDRESS >> 32);
    srd_bd_addr[1] |= 0xC000; /* The two upper bits shall be set to 1 */
#else
    /* Get RNG semaphore */
    while( LL_HSEM_1StepLock( HSEM, CFG_HW_RNG_SEMID ) );
    
    /* Enable RNG */
    __HAL_RNG_ENABLE(&hrng);
    
    /* Enable HSI48 oscillator */
    LL_RCC_HSI48_Enable();
    /* Wait until HSI48 is ready */
    while( ! LL_RCC_HSI48_IsReady( ) );
    
    if (HAL_RNG_GenerateRandomNumber(&hrng, &srd_bd_addr[1]) != HAL_OK)
    {
      /* Random number generation error */
      Error_Handler();
    }
    if (HAL_RNG_GenerateRandomNumber(&hrng, &srd_bd_addr[0]) != HAL_OK)
    {
      /* Random number generation error */
      Error_Handler();
    }
    srd_bd_addr[1] |= 0xC000; /* The two upper bits shall be set to 1 */
    
    /* Disable HSI48 oscillator */
    LL_RCC_HSI48_Disable();
    
    /* Disable RNG */
    __HAL_RNG_DISABLE(&hrng);
    
    /* Release RNG semaphore */
    LL_HSEM_ReleaseLock( HSEM, CFG_HW_RNG_SEMID, 0 );
#endif 
    
