STMicroelectronics/STM32CubeWB/Projects/P-NUCLEO-WB55.Nucleo/Applications/BLE/BLE_AT_Server/STM32_WPAN/App/app_ble.c
    memcpy(&global_rand_bdaddress[0], srd_bd_addr, sizeof(global_rand_bdaddress));
    /* BLE MAC in ADV Packet */
    manuf_data[ sizeof(manuf_data)-6] = srd_bd_addr[1] >> 8 ;
    manuf_data[ sizeof(manuf_data)-5] = srd_bd_addr[1];
    manuf_data[ sizeof(manuf_data)-4] = srd_bd_addr[0] >> 24;
    manuf_data[ sizeof(manuf_data)-3] = srd_bd_addr[0] >> 16;
    manuf_data[ sizeof(manuf_data)-2] = srd_bd_addr[0] >> 8;
    manuf_data[ sizeof(manuf_data)-1] = srd_bd_addr[0];
    
    ret = aci_hal_write_config_data( CONFIG_DATA_RANDOM_ADDRESS_OFFSET, CONFIG_DATA_RANDOM_ADDRESS_LEN, (uint8_t*)srd_bd_addr );

    if (ret != BLE_STATUS_SUCCESS)
    {
      APP_DBG_MSG("  Fail   : aci_hal_write_config_data command - CONFIG_DATA_RANDOM_ADDRESS_OFFSET, result: 0x%x \n", ret);
    }
    else
    {
      APP_DBG_MSG("  Success: aci_hal_write_config_data command - CONFIG_DATA_RANDOM_ADDRESS_OFFSET\n");
      APP_DBG_MSG("  Random Bluetooth Address: %02x:%02x:%02x:%02x:%02x:%02x\n", (uint8_t)(srd_bd_addr[1] >> 8),
                                                                                 (uint8_t)(srd_bd_addr[1]),
                                                                                 (uint8_t)(srd_bd_addr[0] >> 24),
                                                                                 (uint8_t)(srd_bd_addr[0] >> 16),
                                                                                 (uint8_t)(srd_bd_addr[0] >> 8),
                                                                                 (uint8_t)(srd_bd_addr[0]));
    }
    
  }

  /**
   * Write Identity root key used to derive IRK and DHK(Legacy)
   */
  aci_hal_write_config_data(CONFIG_DATA_IR_OFFSET,
                            CONFIG_DATA_IR_LEN,
                            (uint8_t*) BLE_CFG_IR_VALUE);

   /**
   * Write Encryption root key used to derive LTK and CSRK
   */
  aci_hal_write_config_data(CONFIG_DATA_ER_OFFSET,
                            CONFIG_DATA_ER_LEN,
                            (uint8_t*) BLE_CFG_ER_VALUE);


  /**
   * Write Identity root key used to derive IRK and DHK(Legacy)
   */
    aci_hal_write_config_data( CONFIG_DATA_IR_OFFSET, CONFIG_DATA_IR_LEN, (uint8_t*)BLE_CFG_IR_VALUE );

   /**
   * Write Encryption root key used to derive LTK and CSRK
   */
    aci_hal_write_config_data( CONFIG_DATA_ER_OFFSET, CONFIG_DATA_ER_LEN, (uint8_t*)BLE_CFG_ER_VALUE );

  /**
   * Set TX Power.
   */
    aci_hal_set_tx_power_level(1, global_tx_power_code);

  /**
   * Set adv name.
   */
    strcpy(local_name_var + 1, global_name);

  /**
   * Initialize GATT interface
   */
  aci_gatt_init();

  /**
   * Initialize GAP interface
   */
  role = 0;

#if (BLE_CFG_PERIPHERAL == 1)
  role |= GAP_PERIPHERAL_ROLE;
#endif

#if (BLE_CFG_CENTRAL == 1)
  role |= GAP_CENTRAL_ROLE;
#endif /* BLE_CFG_CENTRAL == 1 */

/* USER CODE BEGIN Role_Mngt*/

/* USER CODE END Role_Mngt */

  if (role > 0)
  {
    aci_gap_init(role, 0,
                 APPBLE_GAP_DEVICE_NAME_LENGTH,
                 &gap_service_handle, &gap_dev_name_char_handle, &gap_appearance_char_handle);

    if (aci_gatt_update_char_value(gap_service_handle, gap_dev_name_char_handle, 0, strlen(local_name_var)-1, (uint8_t *) &(local_name_var[1])))
    {
      BLE_DBG_SVCCTL_MSG("Device Name aci_gatt_update_char_value failed.\n");
    }
  }

  if(aci_gatt_update_char_value(gap_service_handle,
                                gap_appearance_char_handle,
                                0,
                                2,
                                (uint8_t *)&appearance))
  {
    BLE_DBG_SVCCTL_MSG("Appearance aci_gatt_update_char_value failed.\n");
  }
  /**
   * Initialize Default PHY
   */
  hci_le_set_default_phy(ALL_PHYS_PREFERENCE,TX_2M_PREFERRED,RX_2M_PREFERRED);

  Custom_SVC_Init();
  /**
   * Initialize IO capability
   */
  BleApplicationContext.BleApplicationContext_legacy.bleSecurityParam.ioCapability = global_io_capability;

  aci_gap_set_io_capability(BleApplicationContext.BleApplicationContext_legacy.bleSecurityParam.ioCapability);

  /**
   * Initialize authentication
   */
  BleApplicationContext.BleApplicationContext_legacy.bleSecurityParam.mitm_mode = global_mitm;
  BleApplicationContext.BleApplicationContext_legacy.bleSecurityParam.sc_support = global_scsupport;
  BleApplicationContext.BleApplicationContext_legacy.bleSecurityParam.encryptionKeySizeMin = CFG_ENCRYPTION_KEY_SIZE_MIN;
  BleApplicationContext.BleApplicationContext_legacy.bleSecurityParam.encryptionKeySizeMax = CFG_ENCRYPTION_KEY_SIZE_MAX;
  BleApplicationContext.BleApplicationContext_legacy.bleSecurityParam.Use_Fixed_Pin = global_usefixedpin;
  BleApplicationContext.BleApplicationContext_legacy.bleSecurityParam.Fixed_Pin = global_fixedpin;
  BleApplicationContext.BleApplicationContext_legacy.bleSecurityParam.bonding_mode = global_bonding;

  aci_gap_set_authentication_requirement(BleApplicationContext.BleApplicationContext_legacy.bleSecurityParam.bonding_mode,
                                         BleApplicationContext.BleApplicationContext_legacy.bleSecurityParam.mitm_mode,
                                         BleApplicationContext.BleApplicationContext_legacy.bleSecurityParam.sc_support,
                                         CFG_KEYPRESS_NOTIFICATION_SUPPORT,
                                         BleApplicationContext.BleApplicationContext_legacy.bleSecurityParam.encryptionKeySizeMin,
                                         BleApplicationContext.BleApplicationContext_legacy.bleSecurityParam.encryptionKeySizeMax,
                                         BleApplicationContext.BleApplicationContext_legacy.bleSecurityParam.Use_Fixed_Pin,
                                         BleApplicationContext.BleApplicationContext_legacy.bleSecurityParam.Fixed_Pin,
                                         global_ble_addr_type | global_ble_cfg_addr_type
                                         );

  /**
   * Initialize whitelist
   */
   if (BleApplicationContext.BleApplicationContext_legacy.bleSecurityParam.bonding_mode)
   {
     aci_gap_configure_whitelist();
   }
}

