STMicroelectronics/STM32CubeWB/Projects/P-NUCLEO-WB55.Nucleo/Applications/BLE/BLE_AT_Server/STM32_WPAN/App/app_ble.c
#if (L2CAP_REQUEST_NEW_CONN_PARAM != 0 )
static void Connection_Interval_Update_Req( void )
{
  if (BleApplicationContext.Device_Connection_Status != APP_BLE_FAST_ADV && BleApplicationContext.Device_Connection_Status != APP_BLE_IDLE)
  {
    BLE_SVC_L2CAP_Conn_Update(BleApplicationContext.BleApplicationContext_legacy.connectionHandle);
  }
  
  return;
}
#endif

/* USER CODE BEGIN FD_SPECIFIC_FUNCTIONS */

static void Manage_Service_Init(void)
{
  /* if P2P_server */
  if (global_svc_index == 1)
  {
    strcpy(global_name, "P2PSRV1");
    local_name_var[0] = AD_TYPE_COMPLETE_LOCAL_NAME;
    strcpy(&local_name_var[1], global_name);
    
    manuf_data[0] = sizeof(manuf_data)-1;
    manuf_data[1] = AD_TYPE_MANUFACTURER_SPECIFIC_DATA;
    manuf_data[2] = 0x01;
    manuf_data[3] = CFG_DEV_ID_P2P_SERVER1;
    manuf_data[4] = 0x00;
    manuf_data[5] = 0x00;
    manuf_data[6] = 0x00;
    manuf_data[7] = 0x00;
    manuf_data[8] = 0x00;
    manuf_data[9] = 0x00;
    manuf_data[10] = 0x00;
    manuf_data[11] = 0x00;
    manuf_data[12] = 0x00;
    manuf_data[13] = 0x00;
  }
  /* if Heart rate */
  else if (global_svc_index == 2)
  {
    strcpy(global_name, "HRSTM");
    local_name_var[0] = AD_TYPE_COMPLETE_LOCAL_NAME;
    strcpy(&local_name_var[1], global_name);

    manuf_data[0] = sizeof(manuf_data)-1;
    manuf_data[1] = AD_TYPE_MANUFACTURER_SPECIFIC_DATA;
    manuf_data[2] = 0x01;
    manuf_data[3] = 0x00;
    manuf_data[4] = 0x00;
    manuf_data[5] = 0x00;
    manuf_data[6] = 0x00;
    manuf_data[7] = 0x00;
    manuf_data[8] = 0x00;
    manuf_data[9] = 0x00;
    manuf_data[10] = 0x00;
    manuf_data[11] = 0x00;
    manuf_data[12] = 0x00;
    manuf_data[13] = 0x00;
  }

  SVCCTL_Init();

  Ble_Hci_Gap_Gatt_Init();

  if (global_svc_index == 1)
  {
  /**
   * Initialize P2P Server Application
   */
   P2PS_STM_Init();
   P2PS_APP_Init();
   /**
   * Make device discoverable
   */
   BleApplicationContext.BleApplicationContext_legacy.advtServUUID[0] = NULL;
   BleApplicationContext.BleApplicationContext_legacy.advtServUUIDlen = 0;

   /* Initialize intervals for reconnexion without intervals update */
   AdvIntervalMin = CFG_FAST_CONN_ADV_INTERVAL_MIN;
   AdvIntervalMax = CFG_FAST_CONN_ADV_INTERVAL_MAX;
  }
  else if (global_svc_index == 2)
  {
    /**
    * Initialize DIS Application
    */
    DISAPP_Init();
    /**
    * Initialize HRS Application
    */
    HRS_Init();
    HRSAPP_Init();
    /**
    * Make device discoverable
    */
    BleApplicationContext.BleApplicationContext_legacy.advtServUUID[0] = AD_TYPE_16_BIT_SERV_UUID;
    BleApplicationContext.BleApplicationContext_legacy.advtServUUIDlen = 1;
    Add_Advertisment_Service_UUID(HEART_RATE_SERVICE_UUID);

    /* Initialize intervals for reconnexion without intervals update */
    AdvIntervalMin = CFG_FAST_CONN_ADV_INTERVAL_MIN;
    AdvIntervalMax = CFG_FAST_CONN_ADV_INTERVAL_MAX;
  }
  
  Adv_Request(APP_BLE_FAST_ADV);
  
  return;
}

static void Manage_Start_Stop_Adv_Init(void)
{
  tBleStatus result;
 
  /* stop advertising */
  if (global_adv_enable == 0)
  {
    result = aci_gap_set_non_discoverable();
    if (result == BLE_STATUS_SUCCESS)
    {
      printf("non discoverable, Successfully \r\n\r");
    }
    else
    {
      printf("non discoverable, Failed \r\n\r");
    }
  }
  /* start advertising */
  else if (global_adv_enable == 1)
  {
    result = aci_gap_set_discoverable(global_adv_type, 
                                      global_adv_int_min, 
                                      global_adv_int_max, 
                                      global_ble_addr_type | global_ble_cfg_addr_type, 
                                      0x00, 
                                      strlen(local_name_var),
                                      (uint8_t*) &local_name_var,
                                      BleApplicationContext.BleApplicationContext_legacy.advtServUUIDlen,
                                      BleApplicationContext.BleApplicationContext_legacy.advtServUUID, 0x0000, 0x0000);
    if (result == BLE_STATUS_SUCCESS)
    {
      printf("set discoverable, Successfully \r\n\r");
    }
    else
    {
      printf("set discoverable, Failed 0x%x\r\n\r", result);
    }
  }
  
  return;
}

static void Manage_Custom_Service_Init(void)
{
  tBleStatus result = BLE_STATUS_INVALID_PARAMS;
  uint8_t service_uuid[16] = {0x8f, 0xe5, 0xb3, 0xd5, 0x2e, 0x7f, 0x4a, 0x98, 0x2a, 0x48, 0x7a, 0xcc, 0x00, 0x00, 0x00, 0x00};
  
  service_uuid[12] = (uint8_t)(global_svc_uuid);
  service_uuid[13] = (uint8_t)(global_svc_uuid >> 8);
  
  Custom_SVC_Init();
    
  if (global_svc_uuid_type == UUID_TYPE_16)
  {
    result = aci_gatt_add_service(global_svc_uuid_type, (Service_UUID_t *)&global_svc_uuid, 
                         PRIMARY_SERVICE, global_max_attr, &(Custom_Context.SvcHdle[global_svc_index - CUSTOM_APP_SVC_OFFSET]));
  }
  else if (global_svc_uuid_type == UUID_TYPE_128)
  {
    /* convert uuid_16b into uuid_128b */
    result = aci_gatt_add_service(global_svc_uuid_type, (Service_UUID_t *)service_uuid, 
                         PRIMARY_SERVICE, global_max_attr, &(Custom_Context.SvcHdle[global_svc_index - CUSTOM_APP_SVC_OFFSET]));
  }
  if (result == BLE_STATUS_SUCCESS)
  {
    printf("Add service, Successfully \r\n\r");
  }
  else
  {
    printf("Add service, Failed \r\n\r");
  }
  
  return;
}

static void Manage_Ble_Init(void)
{
  manuf_data[0] = sizeof(manuf_data)-1;
  manuf_data[1] = AD_TYPE_MANUFACTURER_SPECIFIC_DATA;
  manuf_data[2] = 0x01;
  manuf_data[3] = 0x00;
  manuf_data[4] = 0x00;
  manuf_data[5] = 0x00;
  manuf_data[6] = 0x00;
  manuf_data[7] = 0x00;
  manuf_data[8] = 0x00;
  manuf_data[9] = 0x00;
  manuf_data[10] = 0x00;
  manuf_data[11] = 0x00;
  manuf_data[12] = 0x00;
  manuf_data[13] = 0x00;
    
  Ble_Hci_Gap_Gatt_Init();
  
  return;
}

static void Manage_Charac_Init(void)
{
  tBleStatus result = BLE_STATUS_INVALID_PARAMS;
  uint8_t char_uuid[16] = {0x19, 0xed, 0x82, 0xae, 0xed, 0x21, 0x4c, 0x9d, 0x41, 0x45, 0x22, 0x8e, 0x00, 0x00, 0x00, 0x00};
  
  char_uuid[12] = (uint8_t)(global_char_uuid);
  char_uuid[13] = (uint8_t)(global_char_uuid >> 8);
  
  if (global_char_uuid_type == UUID_TYPE_16)
  {
    result = aci_gatt_add_char( Custom_Context.SvcHdle[global_svc_id - CUSTOM_APP_SVC_OFFSET], global_char_uuid_type, (Char_UUID_t *)&global_char_uuid, global_char_value_len,
                               global_char_properties, global_char_sec_permission, global_gatt_event_mask,
                               10, 1, &(Custom_Context.CharHdle[global_svc_id - CUSTOM_APP_SVC_OFFSET][global_char_id - 1]));
  }
  else if (global_char_uuid_type == UUID_TYPE_128)
  {
    /* convert uuid_16b into uuid_128b */
    result = aci_gatt_add_char( Custom_Context.SvcHdle[global_svc_id - CUSTOM_APP_SVC_OFFSET], global_char_uuid_type, (Char_UUID_t *)char_uuid, global_char_value_len,
                               global_char_properties, global_char_sec_permission, global_gatt_event_mask,
                               10, 1, &(Custom_Context.CharHdle[global_svc_id - CUSTOM_APP_SVC_OFFSET][global_char_id - 1]));
  }
  if (result == BLE_STATUS_SUCCESS)
  {
    printf("Add characteristic, Successfully \r\n\r");
  }
  else
  {
    printf("Add characteristic, Failed \r\n\r");
  }
  
  return;
}

