STMicroelectronics/STM32CubeWB/Projects/P-NUCLEO-WB55.Nucleo/Applications/BLE/BLE_AT_Server/STM32_WPAN/App/app_ble.c
static void Manage_Peripheral_Security_Request(void)
{
  tBleStatus result;
  
  result = aci_gap_slave_security_req(BleApplicationContext.BleApplicationContext_legacy.connectionHandle);
  if( result == BLE_STATUS_SUCCESS )
  {
    printf("Peripheral_security_req(), Successfully \r\n\r");
  }
  else
  {
    printf("Peripheral_security_req(), Failed \r\n\r");
  }
  
  return;
}

static void Manage_Pairing_Confirm_Answer(void)
{
  tBleStatus result;
  
  result = aci_gap_numeric_comparison_value_confirm_yesno(BleApplicationContext.BleApplicationContext_legacy.connectionHandle,
                                                           global_pairing_confirm);
  if( result == BLE_STATUS_SUCCESS )
  {
    printf("Pairing_Confirm_Answer(), Successfully \r\n\r");
  }
  else
  {
    printf("Pairing_Confirm_Answer(), Failed \r\n\r");
  }
  
  return;
}

static void Manage_Pass_Key_Resp(void)
{
  tBleStatus result;
  
  result = aci_gap_pass_key_resp(BleApplicationContext.BleApplicationContext_legacy.connectionHandle,
                                 global_pass_key_resp);
  
  if( result == BLE_STATUS_SUCCESS )
  {
    printf("Pass_Key_Resp(), Successfully \r\n\r");
  }
  else
  {
    printf("Pass_Key_Resp(), Failed \r\n\r");
  }
  
  return;
}

static void Manage_IO_Capability(void)
{
  tBleStatus result;
  
  result = aci_gap_set_io_capability(global_io_capability);
  if( result == BLE_STATUS_SUCCESS )
  {
    printf("IO_Capability(), Successfully \r\n\r");
  }
  else
  {
    printf("IO_Capability(), Failed \r\n\r");
  }
  
  return;
}

static void Manage_set_authen_req(void)
{
  tBleStatus result;
  
  result = aci_gap_set_authentication_requirement(global_bonding,global_mitm,global_scsupport,0x00,0x07,0x10,
                                                  global_usefixedpin,global_fixedpin,global_addrtype);
  if( result == BLE_STATUS_SUCCESS )
  {
    printf("set_authentication_req(), Successfully \r\n\r");
  }
  else
  {
    printf("set_authentication_req(), Failed \r\n\r");
  }
  
  return;
}

static void Manage_clear_db(void)
{
  tBleStatus result;
  
  result = aci_gap_clear_security_db();
  if( result == BLE_STATUS_SUCCESS )
  {
    printf("Clear_security_db(), Successfully \r\n\r");
  }
  else
  {
    printf("Clear_security_db(), Failed \r\n\r");
  }
  
  return;
}

static void Manage_hci_reset(void)
{
  hci_reset();
  
  return;
}

static void Manage_Update_Connection(void)
{
  tBleStatus result;

  result = aci_l2cap_connection_parameter_update_req(BleApplicationContext.BleApplicationContext_legacy.connectionHandle,
                                                     (uint16_t)(global_conn_int_min / 1.25f),
                                                     (uint16_t)(global_conn_int_max / 1.25f),
                                                     L2CAP_PERIPHERAL_LATENCY, L2CAP_TIMEOUT_MULTIPLIER);
  if( result == BLE_STATUS_SUCCESS )
  {
    printf("BLE_SVC_L2CAP_Conn_Update(), Successfully \r\n\r");
  }
  else
  {
    printf("BLE_SVC_L2CAP_Conn_Update(), Failed \r\n\r");
  }
  
  return;
}

static void Manage_Update_Charac(void)
{
  tBleStatus result;

  if (global_notif_serv_index == 1)
  {
    if (global_notif_char_index == 2)
    {
      if (global_notif_val_tab[0] == 1)
      {
        P2PS_Send_Notification_ATcommand();
      }
    }
  }
  else if (global_notif_serv_index == 2)
  {
    if (global_notif_char_index == 1)
    {
      HRSAPP_Context.MeasurementvalueChar.MeasurementValue = global_notif_val_tab[0];
      HRSAPP_Context.MeasurementvalueChar.EnergyExpended = 0;
    }
    else if (global_notif_char_index == 3)
    {
      HRSAPP_Context.MeasurementvalueChar.EnergyExpended = global_notif_val_tab[0];
    }
    result = HRS_UpdateChar(HEART_RATE_MEASURMENT_UUID, (uint8_t*)&HRSAPP_Context.MeasurementvalueChar);
    if (result == BLE_STATUS_SUCCESS)
    {
      printf("HRS_UpdateChar, Successfully \r\n\r");
    }
    else
    {
      printf("HRS_UpdateChar, Failed \r\n\r");
    }
  }
  else
  {
    Custom_Send_Notification_ATcommand();
  }
  
  return;
}

static void Manage_Indication_Update_Charac(void)
{
  Custom_Send_Indication_ATcommand();
  
  return;
}
//#endif
/* USER CODE END FD_SPECIFIC_FUNCTIONS */
/*************************************************************
 *
 * WRAP FUNCTIONS
 *
 *************************************************************/
void hci_notify_asynch_evt(void* pdata)
{
  UTIL_SEQ_SetTask(1 << CFG_TASK_HCI_ASYNCH_EVT_ID, CFG_SCH_PRIO_0);
  
  return;
}

void hci_cmd_resp_release(uint32_t flag)
{
  UTIL_SEQ_SetEvt(1 << CFG_IDLEEVT_HCI_CMD_EVT_RSP_ID);
  
  return;
}

void hci_cmd_resp_wait(uint32_t timeout)
{
  UTIL_SEQ_WaitEvt(1 << CFG_IDLEEVT_HCI_CMD_EVT_RSP_ID);
  
  return;
}

static void BLE_UserEvtRx( void * pPayload )
{
  SVCCTL_UserEvtFlowStatus_t svctl_return_status;
  tHCI_UserEvtRxParam *pParam;

  pParam = (tHCI_UserEvtRxParam *)pPayload;

  svctl_return_status = SVCCTL_UserEvtRx((void *)&(pParam->pckt->evtserial));
  if (svctl_return_status != SVCCTL_UserEvtFlowDisable)
  {
    pParam->status = HCI_TL_UserEventFlow_Enable;
  }
  else
  {
    pParam->status = HCI_TL_UserEventFlow_Disable;
  }
  
  return;
}

static void BLE_StatusNot( HCI_TL_CmdStatus_t status )
{
  uint32_t task_id_list;
  
  switch (status)
  {
    case HCI_TL_CmdBusy:
      /**
       * All tasks that may send an aci/hci commands shall be listed here
       * This is to prevent a new command is sent while one is already pending
       */
      task_id_list = (1 << CFG_LAST_TASK_ID_WITH_HCICMD) - 1;
      UTIL_SEQ_PauseTask(task_id_list);

      break;

    case HCI_TL_CmdAvailable:
      /**
       * All tasks that may send an aci/hci commands shall be listed here
       * This is to prevent a new command is sent while one is already pending
       */
      task_id_list = (1 << CFG_LAST_TASK_ID_WITH_HCICMD) - 1;
      UTIL_SEQ_ResumeTask(task_id_list);

      break;

    default:
      break;
  }
  
  return;
}

void SVCCTL_ResumeUserEventFlow( void )
{
  hci_resume_flow();
  
  return;
}

void SVCCTL_SvcInit(void)
{
  return;
}

/* USER CODE BEGIN FD_WRAP_FUNCTIONS */

/* USER CODE END FD_WRAP_FUNCTIONS */
